#### Terraform Format and Style `success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/udienz/route53/runs/run-pngCKQrwjcuxkPbp

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.mmi_cname_www will be created
  + resource "aws_route53_record" "mmi_cname_www" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.mahyuddin.my.id"
      + records         = [
          + "mahyuddin-blog-cg8zx.ondigitalocean.app.",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.mmi_nameservers will be created
  + resource "aws_route53_record" "mmi_nameservers" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mahyuddin.my.id"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "NS"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.mwi_cname_www will be created
  + resource "aws_route53_record" "mwi_cname_www" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.mahyuddin.web.id"
      + records         = [
          + "mahyuddin-blog-cg8zx.ondigitalocean.app.",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.mwi_nameservers will be created
  + resource "aws_route53_record" "mwi_nameservers" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mahyuddin.web.id"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "NS"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.umi_cname_www will be created
  + resource "aws_route53_record" "umi_cname_www" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.udienz.my.id"
      + records         = [
          + "udienz-blog-cg8zx.ondigitalocean.app.",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.umi_nameservers will be created
  + resource "aws_route53_record" "umi_nameservers" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "udienz.my.id"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "NS"
      + zone_id         = (known after apply)
    }

  # aws_route53_zone.mmi will be created
  + resource "aws_route53_zone" "mmi" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "mahyuddin.my.id"
      + name_servers  = (known after apply)
      + tags_all      = (known after apply)
      + zone_id       = (known after apply)
    }

  # aws_route53_zone.mwi will be created
  + resource "aws_route53_zone" "mwi" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "mahyuddin.web.id"
      + name_servers  = (known after apply)
      + tags_all      = (known after apply)
      + zone_id       = (known after apply)
    }

  # aws_route53_zone.umi will be created
  + resource "aws_route53_zone" "umi" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "udienz.my.id"
      + name_servers  = (known after apply)
      + tags_all      = (known after apply)
      + zone_id       = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @udienz, Action: `pull_request`*